Revit 2026 API

# FailuresAccessorSetFailureHandlingOptions Method

---

Sets failure handling options for the transaction currently being finished.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetFailureHandlingOptions(
	FailureHandlingOptions options
)
```
```vb
Public Sub SetFailureHandlingOptions (
	options As FailureHandlingOptions
)
```
```cpp
public:
void SetFailureHandlingOptions(
	FailureHandlingOptions^ options
)
```
```fsharp
member SetFailureHandlingOptions :
        options : FailureHandlingOptions -> unit
```

#### Parameters

options FailureHandlingOptions
     The failure handling options to be set for the transaction currently being finished.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |
| InvalidOperationException | This FailuresAccessor is inactive (is used outside of failures processing). |

If used with returning ProceedWithRollback from (pre)processing, allows to dismiss errors and roll back transaction without any further failures processing and silently for the user.

#### Reference

FailuresAccessor Class

Autodesk.Revit.DB Namespace